package sec01;

public class C_11 {
	/*
	 11장 컬렉션 프레임 워크
	   -- 배열을 사용해서 생기는 문제점 :
	   	   새로운 객체를 저장하려면 어디가 비어 있는지 확인하는 코드가 필요하다.
	   	   자료를 저장할 때 흔히 배열을 사용하지만 추가, 삭제할 때 중간에 비어지는 것이 발생할 수 있으므로 여러가지 문제점이 생긴다.
	   -- 배열의 문제점 해결
	   		자료구조를 바탕으로 객체들을 효율적으로 추가, 삭제, 검색할 수 있도록 프로그램을 작성한다.
	   		자바에서는 java.util 패키지에 컬렉션과 관련된 인터페이스와 클래스들을 넣어 두었다.
	   
	   -- 컬렉션 프레임워크
	      컬렉션이란 : 사전적인 의미로 요소를 수집해서 저장하는 것
	      프레임워크란 : 사용 방법(규칙)을 미리 정해 놓은 라이브러리
	   -- Collection 인터페이스 부모입니다. 아래있는 인터페이스는 자식인터페이스입니다.
	   		: 데이터를 한곳에 모아 편리하게 관리하는 최상위 인터페이스입니다.
	   -- 자바 컬렉션 프레임워크 주요 인터페이스
	   		List : 배열과 유사하게 인덱스로 관리한다.
	   			구현클래스API : ArrayList, Vector, LinkedList
	   		Set : 집합과 유사하고 인덱스 없다.
	   			구현클래스API : HashSet, TreeSet
	   		Queue : 입력한 순서대로 저장되며 객체가 중복될 수 있다.
	   			구현클래스API : DelayQueue, LinkedList
	   -- 개별로 된 프레임워크 Map : 키와 값이 한쌍으로 관리
	   			구현클래스API : HastMap, HashTable,TreeMap 
	 
	 */
	
	
	
	
}
